let 華氏溫度 = 0
let 熱指數華氏 = 0
// HI = -42.379 + 2.04901523*T + 10.14333127*RH - .22475541*T*RH -.00683783*T*T - .05481717*RH*RH + .00122874*T*T*RH + .00085282*T*RH*RH- .00000199*T*T*RH*RH
basic.forever(function () {
    let 相對濕度 = 0
    let 攝氏溫度 = 0
    dht11_dht22.selectTempType(tempType.celsius)
    華氏溫度 = 攝氏溫度 * 9 / 5 + 32
    熱指數華氏 = -42.379 + 2.04901523 * 華氏溫度 + 10.14333127 * 相對濕度 - 0.22475541 * (華氏溫度 * 相對濕度) - 0.00683783 * (華氏溫度 * 華氏溫度) - 0.05481717 * (相對濕度 * 相對濕度) + 0.00122874 * (華氏溫度 * (華氏溫度 * 相對濕度)) + 0.00085282 * (華氏溫度 * (相對濕度 * 相對濕度)) - 0.00000199 * (華氏溫度 * 華氏溫度) * (相對濕度 * 相對濕度)
})
basic.forever(function () {
    let 熱指數攝氏 = 0
    basic.showNumber(熱指數攝氏)
})
